<template>
  <div class="course">
    <main-header @new-item="newCourse">
      <template #left>
        <el-input size="small" placeholder="id" />
        <el-input size="small" placeholder="课程名称" />
        <el-button size="small" type="primary">查询</el-button>
      </template>
    </main-header>
    <div class="course-main">
      <my-table :table-config="tableConfig" :table-data="tableData"></my-table>
    </div>
  </div>
</template>

<script setup lang="ts">
import MainHeader from "@/components/MainHeader.vue";
import MyTable from "@/components/MyTable.vue";
import tableConfig from "./components/CourseTable";

const newCourse = () => console.log("new course");
const tableData = [
  {
    id: "1",
    courseName:
      "经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次",
    cards: "12",
    updateTime: "2016-05-02 12:12:12",
  },
  {
    id: "2",
    courseName:
      "经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次",
    cards: "12",
    updateTime: "2016-05-02 12:12:12",
  },
  {
    id: "3",
    courseName:
      "经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次",
    cards: "12",
    updateTime: "2016-05-02 12:12:12",
  },
  {
    id: "4",
    courseName:
      "经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次",
    cards: "12",
    updateTime: "2016-05-02 12:12:12",
  },
  {
    id: "5",
    courseName:
      "经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次经济法全国第一次次次经济法全国第一次经济法全国第一次经济法全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次全国第一次次经济法全国第一次经济法全国第一次经济法全国第一次次",
    cards: "12",
    updateTime: "2016-05-02 12:12:12",
  },
];
</script>

<style scoped lang="less">
.course {
  .el-input {
    width: 100px;
    margin-right: 10px;
  }
  .course-main {
    padding: 10px;
  }
}
</style>
